{
    "s2000": "<p>In this module, we’ll discuss what Ford Commercial Business Solutions is and the added value you can offer your customers over the competition.</p><p>This is intended to provide an overview of Ford Commercial Business Solutions. For specific details about each of the products mentioned in this course, take the Commercial Service Programs Overview web-based course, number 3474W, in the Business Preferred Network curriculum in STARS.</p>",
    "s2001": "<p>Ford Commercial Business Solutions goes beyond what most of your competitors offer. It is a One Ford strategy that provides a total transportation solution for your commercial customers …</p><p>… a comprehensive approach to servicing your commercial customers throughout the ownership life cycle.</p><p>A Ford Commercial Business Solution can be incorporated into a purchase or lease for one-stop shopping to give your customers customized vehicle management that reduces life-cycle costs, improves operational efficiencies, and eliminates service variability.</p>",
    "s2002": "<p>The Solution includes:</p><p>Ford PremiumCARE and Premium Maintenance Extended Service Plans (ESP) and Quality Fleet Care (QFC). In addition, Ford Credit’s commercial financing options, offered at vehicle purchase or lease, allow customers to finance the total cost of ESP and QFC for pennies per mile.</p><p>Next, we’ll begin learning how Ford Commercial Business Solutions delivers valuable benefits to your customers – and to your dealership.</p>",
    "s2003": "<p>The Ford Commercial Business Solution starts with ESP; that is, the PremiumCARE and Premium Maintenance plans. Why should your customers want to invest in these rather than the competition?</p><p>Because we have the time and mileage options for money-saving solutions with zero-deductible to eliminate out-of-pocket costs</p><p>These ESP plans are customizable to help control costs and significantly reduce operating expenses</p><p>Customers can take advantage of the Ford and Lincoln network of more than 33-hundred dealers, plus Quick Lane Tire and Auto Centers, featuring Certified, factory-trained technicians and genuine OE parts that ensure quality repairs</p><p>We provide Roadside Assistance including destination assistance and travel reimbursement, and</p><p>We cover wear and tear</p>",
    "s2004": "<p>Combining Quality Fleet Care with an ESP contract gives you the ability to compete against fleet service management companies. It keeps your customers coming back to you for service and parts – and more vehicles.</p><p>For commercial customers, QFC provides:</p><p>A cardless/cashless solution for fleet drivers</p><p>Monthly billing for all services performed at Ford or Lincoln dealers and Quick Lane Tire and Auto Centers, in the US or Canada</p><p>A National Glass Program that covers replacement and repair with regional pricing and on-site service of OE glass</p><p>Enhanced Roadside Assistance that extends assistance beyond New Vehicle Limited Warranty and Extended Service Plan</p><p>Electronic billing available via CD, FTP, or the QFC Website</p><p>A number of online services available through the dedicated QFC website</p><p>Coverage displayed on OASIS including fleet account contact information</p><p>Non-Ford vehicle eligibility – competitive make vehicles and trailers are eligible</p><p>Quality Fleet Care Parts Program (QFCP) for over the counter part purchases</p>",
    "s2005": "<p>Ford Commercial Business Solutions is the strongest solution in the marketplace.  Competitors have significant disadvantages by comparison. They may say they offer a full maintenance solution, but unlike ESP, their plans are weak and:</p><p>May not meet the customer’s usage requirements</p><p>May delay repairs to negotiate the cost of service</p><p>May not ensure maintenance and repairs are performed by factory-trained technicians using genuine OE parts</p><p>May have wear and tear exclusions, warranty limitations and ,</p><p>May not include rental car provisions</p><p>Competitive plans can’t come close to Quality Fleet Care. They have significant weaknesses that you’ll want to detail for your customers. Specifically:</p><p>They may have maintenance limitations and Limitations on non-covered purchases and services</p><p>They may not cover mixed fleets</p><p>They may not offer spending controls, and </p><p>They may not offer online fleet service management </p><p>Clearly, Ford Commercial Business Solutions is the strongest solution available! </p><p>The reality is, your customers are looking for one-stop shopping to manage their vehicles. If you don’t offer it, they’ll go elsewhere.</p>",
    "s2006": "<p>To complete our comprehensive fleet service management solution for commercial customers, we partner with Ford Credit. Ford Credit offers commercial customers three financing options, all of which allow them to roll in the total cost of  ESP and QFC: </p><p>Commercial Lease, Commercial Lines of Credit, and Commercial Retail Financing. </p><p>Click on each image to learn more about these options.</p><p>CommerciaLease – or TRAC Lease – is a customizable open-ended lease that can be tailored to meet customers’ unique business needs. There are several benefits for your customers, including improved cash flow with payments that are usually lower than traditional financing, no mileage restrictions, and no wear and use lease-end restrictions.</p><p>Commercial Lines of Credit helps commercial customers – whether leasing or buying - get the credit they need when they need it to acquire commercial vehicles faster, easier, and with less hassle. There are no enrollment or maintenance fees, and it frees up capital for other business needs.</p><p>The Commercial Retail Financing option offers commercial customers competitive rates with flexible terms and no hidden fees or GVW restrictions.</p><p>Refer to the Job Aid you downloaded at the start of the course for the Ford Credit website where you can find more information on all of these products. </p>",
    "s2006a": "<p>For dealers, these financing products complete a solution that offers strong competitive advantages over fleet service management companies. They also provide you with an additional source for service revenue .</p><p>How do you know which option is best for which customer? Ford Credit Commercial Brand Director, Lee  Gross, offers advice on characteristics of customers best suited to CommerciaLease, Commercial Lines of Credit and Commercial Retail Financing. <p>Click on the  Lee’s Lesson icon to hear his advice. </p>",
    "s2007": "<p>As you’ve seen, each product in the Ford Commercial Business Solution delivers benefits to your customers. Taken all together, you have a package that is a strong competitor to fleet service management companies and one that you should offer to every one of your commercial customers.</p><p>YOU hold the key to overcoming the competition and growing your commercial business. </p><p>You can provide a comprehensive, customizable transportation solution with one-stop shopping</p><p>You are your customers’ dedicated account manager; the one who works with them to create the best solution for their business needs</p><p>You can help customers reduce their overall vehicle life-cycle costs with ESP, QFC, and finance options that lock in vehicle maintenance expenses in current day dollars and lower lease payments, if applicable</p><p>You can help improve your customers’ operational efficiencies with online billing and fleet service management</p><p>You have an integrated approach that covers sales and service for the life of the vehicle</p><p>You can reduce service variability and expenses for your customers</p><p>In short, you can compete with companies that offer fleet management services and increase your commercial sales.</p>",
    "s2008": "<p>Read the question and select your responses. Then click Submit to see how you did.</p>",
    "s2009": "<p>Ford Credit offers commercial customers three financing options which roll in the total cost of ESP and QFC. Drag  a statement to the correct financing option for that statement. </p>"
}
