{
    "s3000": "<p>In this module, you’ll follow a sales process with a customer to develop Ford Commercial Business Solutions.</p>",
    "s3001": "<p>There are a number of similar processes successful salespeople use to close a sale. You probably have one of your own. In this module, you will use what we call a Solution-based Selling Approach to develop a Ford Commercial Business Solution proposal.</p><p>The steps in the process are:</p><p>Qualify the customer</p><p>Prepare for the sales call</p><p>Present the proposal</p><p>Close the sale, and Maintain the relationship</p>",
    "s3002": "<p>Michelle recognizes the importance of presenting Ford Commercial Business Solutions to every one of her customers. She sees how the commercial business is changing and has already lost a couple of customers to fleet service management companies. So, she’s motivated to stay ahead of the competition.</p><p>She knows she needs to start by understanding a customer’s current situation and his or her wants and needs, so she makes an initial contact with each customer to conduct an assessment.</p>",
    "s3003": "<p>To assess her customers, you and Michelle will use the Customer Interview form. It’s a form that allows you to fill in the information at your computer and it will help you identify a customer’s needs and wants.</p><p>Click on each highlighted section of the form to see what information she will gather.</p><p>You and Michelle will ask about the total size of the fleet and the individual vehicles that make up the fleet, including whether or not they’re Ford or competitive makes and type of engine and fuel.</p><p>You need to know how the customer wants to finance his or her vehicles. Be sure they know you offer leasing in addition to traditional retail financing and that you also offer lines of credit for both options.</p><p>You’ll want to know how the fleet is currently managed – by the fleet manager or a fleet service management company.</p><p>The vehicle maintenance area yields more key information for you and Michelle. It includes questions about schedules, frequency of service, who performs maintenance and repairs, cost-per-mile, and more.</p><p>You’ll also learn how the company disposes of vehicles, any service related issues, component wear-out, and other fleet issues.</p>",
    "s3004": "<p>So, in qualifying the customer you learn a great deal of valuable information:</p><p>The customer is the Fleet Manager of ABC Plumbing and Heating, a large, local plumbing and H-VAC company. The company has a staff of 20 plumbers and H-VAC technicians and five salespeople. Its fleet includes 23 upfitted vans and 6 cars. The cars are leased and three of them are near lease-end</p><p>So, the Fleet Manager is interested in a CommerciaLease to replace the cars. He currently does not have a Ford Identification Number, or FIN code. FIN codes are not required, but there are many advantages to having one. Suggest that all eligible customers enroll by calling 800-343-5338 or visiting www.fleet.ford.com, Contact Us, Get Started with Fleet so they can take advantage of all the benefits available to them.</p><p>All of the fleet vehicles are gas engines. Sixteen of the vans are Ford vehicles, seven are competitive makes. </p><p>The cars are a mix of Ford and competitive models and are assigned to the salespeople based on their preference. Three of the trucks and one of the cars are kept as backups.</p><p>The fleet manager handles all aspects of the fleet and follows his own Preventative Maintenance schedule</p><p>Maintenance is performed every 5-thousand miles by chain shops at various locations. The Fleet Manager acknowledges that service costs can vary.</p><p>Repairs are done at a nearby independent shop.</p><p>Expenses for preventative maintenance run the fleet about 9-and-a-half cents per mile.</p><p>Trucks are traded in after 5 years and an average 22-thousand miles per year.</p><p>The customer complains that tire rod ends tend to wear out prematurely.</p><p>The trucks do move from job to job, and the salespeople are allowed to take their company cars home.</p><p>The customer does want to make sure his employees feel safe in their vehicles.</p><p>This completed form  with all of this information is included in the Job Aid you downloaded at the beginning of this course. Use it as a reference as we progress through this module.</p>",
    "s3005": "<p>With the information you and Michelle have gathered from the customer interview, you begin to work some numbers to create a value proposition that demonstrates the benefits of purchasing ESP PremiumCARE and Premium Maintenance as part of a total life-cycle solution. You and Michelle use the Commercial Cost-Per-Mile Value Builder Quick Quote Tool to calculate how much per mile the contract adds to the transaction and how much it saves the customer.</p><p>At the end of this module, you’ll learn where you can quickly and easily  access  and download this tool.</p><p>Click on the Wiegand’s Wisdom icon for a demonstration of how to use this tool. </p>",
     "s3006": "<p>You’re now ready to move to Step Two in the process: Preparing for the Sales Call. Click \"next\" to continue.</p>",
      "s3007": "<p>Based on what you’ve just learned about your customer, how are you going to address your customer’s wants and needs? Which time and mileage terms will you recommend for ESP PremiumCARE and Premium Maintenance? What other products will you include? Click to make your choices, then click the Submit button to check your answers.</p>",
    "s3009": "<p>This worksheet is an Excel spreadsheet that is available for download on FMCDealer.com, so the calculations are performed automatically when you enter the information. Let’s start with the cost-per-mile value builder quick quote tool  for the customer’s trucks. You just saw Joe step-through this process.  Click next to begin.</p>",
    "s3010": "<p>In the Ford and Competitive Make Car and Light Truck Applications section:</p><p>In the Vehicle field, click on the correct selection from the drop-down menu.</p><p>That’s great! You’ve completed the worksheet! This calculator gives you cents per mile, cost per month, service contract price, prepaid commercial maintenance savings, and the total program cost. You now have your ESP pricing for your customer.<p>Next, the Premium Maintenance Plan savings calculation – which automatically populates data into the Total area near the bottom of the cost-per-mile worksheet you just completed</p>",   
    "s3017": "<p>With this worksheet, you can calculate the cost of the Premium Maintenance Plan and the savings to the customer. The savings automatically populate the Commercial Cost-per-Mile Value Builder Quick Quote Tool.</p><p>You can see that we’ve entered the relevant limited wear item replacements information for your customer. The form then indicates the total cost for all maintenance items, the retail cost of the maintenance plan, and the cost saving to the customer. Note that you would complete the cost-per-mile and Premium Maintenance savings calculation for every vehicle your customer is interested in purchasing.</p><p>These worksheets not only help you price the ESP plans, they give you data you can share with your customer that demonstrates the value of purchasing these plans to manage costs and save them money.</p>",
    "s3018": "<p>You definitely need to discuss lease options with your customers ...  you can bet your competition is! </p><p>For some customers, there may be tax and cash flow benefits to leasing vs. purchasing, so they’ll be interested in what you present. It’s also important to encourage these customers to talk to their tax advisor before finalizing the transaction.</p><p>Leasing is an integral part of the Ford Commercial Business Solution, so you and Michelle can employ another helpful tool with these customers. </p><p>Since your customer leases the cars in his fleet and some are close to lease-end, you’ll want to provide a CommerciaLease Quick Quote. This will help your customer understand how financing the ESP will affect his lease payment. </p><p>This form is actually another tab in the Cost-per-mile Value Builder Excel spreadsheet. It integrates the cost-per-mile calculation along with a Ford Commercial Business Solutions total cost to estimate the total monthly lease payment.</p><p>Click on the Lee’s Lesson icon for a demonstration of how this tool works. It picks up from where Joe left off in his Cost-per-Mile demonstration.</p>",
    "s3019": "<p>You’re now ready to move to Step Three in the process: Present the Proposal.  Click \"next\" to continue.</p>",
     "s3020": "<p>Michelle now has the information she needs to understand her customer’s requirements. She has performed cost-per-mile, Premium Maintenance savings, and CommerciaLease Quick Quote calculations. She’s ready to develop a sales presentation on Ford Commercial Business Solutions for her customer.</p><p>Why does Michelle do this? Because it enhances her professional image, helps her make her business case to her customers, and positions her well against competing companies that come prepared with professional presentations.</p><p>Again, we have made it easy for Michelle and YOU to create a professional sales presentation. Simply use the  Customer Sales Presentation PowerPoint template that you can include in the Commercial Vehicle Dealer Kit folder materials available at the Dealer eStore through FMCDealer.com. </p>",
    "s3021": "<p>Michelle starts by adding the appropriate dealership information indicated on the template slides.</p><p>Michelle adds the dealership name to the cover, the name of the customer, dealership, date and proposal presenter to the next slide. She continues adding the dealership name and any other information indicated on the appropriate pages.</p><p>When she gets to the Dealership Provided Services page, Michelle lists any services her dealership will offer as part of the Ford Commercial Business Solution; for example, Quick Lane, extended service hours, pickup and delivery, or a dedicated Service Advisor. Mentioning them  helps communicate the value of Ford Commercial Business Solutions.</p>",
    "s3022": "<p>Here is the cover page and the additional services page customized with Michelle’s dealership name and information.</p>",
    "s3023": "<p>Next, Michelle enters the relevant customer information into the presentation template. Click on each customer page image for an example of how you can enter customer information.</p><p>For her lease customers, Michelle inserts their CommerciaLease Quick Quote in the designated location in the presentation. For customers who are not leasing, this page is deleted.</p><p>The template includes a Ford Credit Commercial Lending section with a slide for each of the three Ford Credit Commercial Lending options. Michelle keeps the slide for the financing she is recommending and the Commercial Line of Credit page and deletes the other slides.</p><p>Michelle then adds the Cost-Per-Mile and Premium Maintenance savings worksheets to the proposal along with any additional customer information indicated in the template.</p><p>One of the advantages of using this template is that you can present it to a customer online and-or as a hard copy. Take the time to make it personal for your customers, so you have a powerful sales proposal that demonstrates your professionalism and helps build the relationship.</p>",
    "s3024": "<p>The Customer Sales Presentation Kit is almost complete and assembled in the Commercial Vehicle Presentation folder. Michelle adds a QFC credit application, relevant presentation materials and brochures to reinforce what they’ve discussed, and the completed worksheets from the Commercial Cost-per-mile Value Builder Quick Quote tool. </p><p>Every dealership should have quantities of these materials in stock to use in marketing and sales efforts. You can order ESP and QFC brochures from the Dealer eStore. You can download Ford Credit Commercial Lending materials by logging onto FMC Dealer, choosing the Finance tab, then the  Commercial Lending Finance link on the left-side of the page</p>",
    "s3025": "<p>When you meet with your customer to present your proposal, focus on the features and benefits of the financing, service and fleet management elements along with the money and time this comprehensive life cycle solution provides.</p><p>If the customer has any objections during your presentation, respond to them by reinforcing the benefits of your proposal.</p><p>Finally, ask for the sale. This is critical. Too many sales are lost because the salesperson did not ask.</p>",
    "s3026": "<p>You’re now ready to move to Steps Four and Five  in the process: Close the Sale and Maintain the Relationship. Click \"next\" to continue.</p>",
    "s3027": "<p>Once you have gained the customer’s agreement, you can close the sale. Follow your dealership’s process and complete the necessary paperwork, including an ESP application, QFC enrollment and credit application.</p><p>And – this is very important – remember to thank your customer for his or her business upon completing the transaction.</p><p>As you know, you’re not done when you’ve closed the sale. Follow-up regularly with your customers to make sure they’re satisfied with their service. You will earn loyal customers when you reinforce the benefits they are enjoying, and respond quickly to any concerns.</p><p>Click on the Wiegand’s Wisdom icon to hear Joe sum it all up.</p>"
}