{
    "s0001": "<p>Welcome to Ford Commercial Business Solutions. In this course you’ll understand the opportunities and the tools you have to grow your business using Ford Commercial Business Solutions. But first, click on the HELP button to learn how to navigate through this course using the various icons on each page.</p>",
    "s0002": "<p>Navigating this course is easy, using familiar controls. Take a moment to review the function of each icon.</p><p>Be sure to click on the \"Resources\" icon to view and print the Job Aid. You’ll need to reference it during and after this course. </p>",
    "s0003all": "<p>Are you losing commercial business to competitors like this?</p><p><b>Fleet Management Company Representative:</b><br>So Ted, while we’re talking about the vehicles you want to order to keep your business expanding, I’d also like to talk about how we can help you manage your expenses throughout the entire ownership cycle.</p><p><b>Customer:</b><br>Well, I do manage my own vehicle expenses, but I’m not sure what you can do for me.</p><p><b>Fleet Management Company Representative:</b><br>We offer a way you can do that more efficiently and more conveniently … and on top of that, save money.</p><p><b>Customer:</b><br>Now, you’ve got my attention. What have you got?</p><p><b>Fleet Management Company Representative:</b><br>Our fleet management plan offers you a full maintenance program with a fixed cost for all routine maintenance and repairs. We’ve got hundreds of service locations across the country. We offer monthly reporting and billing… and a whole lot more</p><p><b>Customer:</b><br>That sounds like something I would be interested in – especially if it saves me time and money. Tell me more.</p>",
    "s0004": "<p>Are you losing your commercial customers to competitors like the one you just viewed? These competitors go beyond just selling or leasing cars and trucks. They offer commercial customers a comprehensive array of products and services to help them manage their vehicles more efficiently and cost-effectively.</p>",
    "s0005": "<p>Other OEMs and companies that offer fleet management services have seen the future of the commercial business and are responding by going after your customers with professional presentations.</p>",
    "s0006": "<p>You can STOP losing business to these competitors!</p><p>In this course, you’ll learn how you can successfully compete against fleet service management companies and grow your commercial business with an integrated, comprehensive commercial business solution.</p>",
    "s0007": "<p>When you have completed this course, you should be able to:<br>Recognize the value of transitioning to a holistic approach to selling to commercial customers<br>Explain the opportunity of the Ford Commercial Business Solutions for increasing dealership commercial business and profitability<br>Identify commercial customer needs and wants for fleet management services<br>Demonstrate the benefits and value of the Ford Commercial Business Solutions over the competition, and<br>Develop customized presentations within a consultative sales process to sell Ford Commercial Business Solutions</p>",
        "s0008": "<p>To accomplish our objectives, here’s the agenda:<br>Module One address the opportunity. Specifically, how you can grow your commercial business by competing with fleet management companies that offer small- to medium-sized commercial customers an ownership life-cycle solution<br>Module Two looks at the products and services of  Ford Commercial Business Solutions<br>In Module Three we’ll present selling strategies and you’ll put it all together using a real-world scenario<br>And, in Module Four, you’ll learn how to access  the Resources and Tools available to support you in growing your Commercial Business.<br></p><p>Along the way, you’ll get some tips and best practices from Ford Motor Company’s Commercial ESP Program Manager, Joe Wiegand and Ford Credit Commercial Brand Director, Lee Gross . Just click on the icon that appears in the lower right corner of your screen. Click now to get started.</p>",
    "s1000": "<p>What is the opportunity out in the marketplace to grow your commercial account business? You might be surprised.</p>",
    "s1001": "<p>Let’s start with the opportunity presented by commercial vehicle sales. The economy is recovering, and companies are replacing vehicles to take advantage of favorable resale values and better fuel economy. In fact, one out of every five new vehicles sold in this country becomes a fleet vehicle. </p><p>We see over half a million commercial-fleet unit sales in the U.S.  Of that, Ford is the leader comprising nearly half of those sales. And, almost a third of all Ford U.S. sales are to commercial customers. Clearly, there’s a huge opportunity to sell ESP – and a fleet service management solution.</p><p>How many are you selling? Your competition is noticing the potential offered by the growing commercial market, and you’re losing business to them. Already the 8 largest fleet service management companies manage service for about 700-thousand Ford vehicles. That’s lost revenue equal to almost three years’ worth of Ford commercial vehicle sales!</p><p>Click the Wiegand’s Wisdom icon to learn more.</p>"
}