{
    "s4000": "<p>In this module, you’ll learn about the resources and tools you can use to develop a Ford Commercial Business Solutions sales presentation for a customer.</p>",
    "s4001": "<p>We’ve made it easy for you to put together a powerful, professional customer presentation for selling Ford Commercial Business Solutions . Start with a Commercial Vehicle Dealer kit and worksheets that help you make your business case to each customer.</p><p>The Commercial Vehicle Dealer kit includes a folder with a competitive comparison chart for Ford Commercial Business Solutions vs. companies that provide fleet management services, a chart comparing Ford commercial service programs, and a Fleet Customer Support brochure. This kit can be ordered in quantity at no cost from Ford’s Dealer eStore. </p>",
    "s4002": "<p>Customizable presentation and worksheets are available for download from the Fleet link on the ESP Home Page on FMCDealer.com.</p><p>Materials include:</p><p>A Customer Interview form – or company profile. This is a guide to get you started in gathering the information you will need about your customer to understand his or her business needs and wants …</p><p>The Commercial Cost-per-mile Value Builder Quick Quote Tool that you can use with customers to demonstrate the cost savings of including ESP PremiumCARE and Premium Maintenance in their purchase or lease transaction. It includes the CommerciaLease Quick Quote calculator that imports the cost-per-mile calculation and figures it into the lease payment to demonstrate the value of including the cost of ESP in a lease.</p><p>The Customer Presentation Template is the package that wraps all this information together in a professional comprehensive Commercial Business Solution.</p>",
    "s4003": "<p>Once at FMCDealer.com, click on the  Parts and Service tab, the ESP link in left menu, and then the Fleet link on the right-hand side of the screen. You can also find resources at qfc.ford-dot.com.  As a reminder, your Job Aid also has this information. Complete Presentation Kits are available from the Dealer eStore reference item FCS-COMM-DLRKIT.</p>",
    "s4004": "<p>There are several Ford websites that are excellent resources for you as you develop your presentation.</p><p>The key websites you’ll visit most often are:</p><p>ESP on FMCDealer.com, QFC,The Ford Credit Commercial Lending page on the Ford Credit website, and The BPN site. These are all listed on your Job Aid. </p><p>Now, it’s your turn to sell Ford Commercial Business Solutions</p>",
    "s5000": "<p> Let’s take a moment to review some key learning points.</p>",
    "s5001": "<p> In this course, you learned about the excellent opportunity you have for growing your commercial business by retaining and recapturing customers with the Ford Commercial Business Solutions.</p><p>The Ford Commercial Business Solutions is a comprehensive vehicle ownership strategy that you can customize to meet your commercial customer’s individual needs. It is an integrated approach that provides reduced life cycle costs, improved operational efficiencies, and the elimination of service variability.</p><p>You now know about the tools and resources you can use to develop customized presentations that will help you sell the Ford Commercial Business Solutions to increase your commercial business.</p>",
    "s5002": "<p>You’ve come to the end of this course. You should now be able to:</p><p>Explain the opportunity offered by Ford Commercial Business Solutions for increasing dealership commercial business and profitability</p><p>Identify commercial customer needs and wants for fleet management services</p><p>Demonstrate the benefits and value of the Ford Commercial Business Solutions over the competition</p><p>Develop customized presentations to sell Ford Commercial Business Solutions, and</p><p>Apply a consultative sales process to successfully sell Ford Commercial Business Solutions</p><p>Good luck, and good selling!</p>"
}
